let facts = [
    "В Австралии существует больше овец, чем людей.",
    "Человеческий нос может запомнить до 50,000 различных запахов.",
    "Страусы могут бегать быстрее, чем лошади.",
    "Медведи коалы спят около 22 часов в день.",
    "Сердце креветки находится в её голове.",
    "Пчелы никогда не спят.",
    "Осьминоги имеют три сердца.",
    "В Японии больше домашних животных, чем детей.",
    "Коты не могут чувствовать сладкий вкус.",
    "Космонавты на МКС видят восход и закат 16 раз в день.",
    "У акулы больше костей в её коже, чем в скелете.",
    "Кенгуру не умеют ходить назад.",
    "Зебры - дальтоники.",
    "Пингвины не умеют летать, но они отличные пловцы.",
    "В Китае есть 56 различных этнических групп.",
    "Каждый день 20 тысяч человек имеют день рождения.",
    "На Юпитере и Сатурне идут дожди из алмазов.",
    "Самый старый из известных золотых рыбок прожил 43 года.",
    "Улитка может спать до трех лет.",
    "Человеческое тело содержит примерно 100 тысяч километров кровеносных сосудов.",
    "Пингвины предлагают камни своим партнерам в знак любви.",
    "Медузы существуют более 650 миллионов лет.",
    "Шоколад был использован в качестве валюты у ацтеков.",
    "У коров есть лучшие друзья, и они становятся беспокойными, когда их разделяют.",
    "Перо страуса весит больше, чем его мозг.",
    "Утконос откладывает яйца, но кормит детенышей молоком.",
    "В Италии есть фонтан, из которого течет красное вино.",
    "Клещи могут жить до 18 лет.",
    "На Марсе закаты кажутся синими из-за его атмосферы.",
    "Бананы радиоактивны из-за содержания калия.",
    "Каждую секунду молния ударяет землю около 100 раз.",
    "Слово 'сельдерей' происходит от греческого слова, означающего 'петрушка'.",
    "Панды едят сидя, как люди.",
    "Мозг человека примерно на 75% состоит из воды.",
    "Коровы могут подниматься по лестнице, но не могут спускаться.",
    "У осьминогов нет костей, поэтому они могут пролезть через очень узкие отверстия.",
    "Древние египтяне использовали крокодиловый навоз в качестве контрацептива.",
    "В Древнем Риме люди чистили зубы мочой.",
    "Земля вращается со скоростью около 1670 километров в час.",
    "Коровы производят больше молока, когда слушают музыку.",
    "Реки на Титане (спутник Сатурна) текут метаном, а не водой.",
    "Сом может 'гулять' по суше, используя свои плавники как ноги.",
    "В Германии есть сауна в виде аэропланов.",
    "Самка гориллы может родить только одного детеныша раз в четыре года.",
    "Существуют рыбы, которые могут летать.",
    "В Саудовской Аравии нет ни одной реки.",
    "Каждый человек в среднем за свою жизнь производит около 25,000 литров слюны.",
    "У звезд морских ежей есть глаза на кончиках своих щупалец.",
    "Страусы могут жить до 75 лет.",
    "Существуют грибы, которые светятся в темноте.",
    "Гепарды могут разгоняться до 112 км/ч в течение нескольких секунд.",
    "Единственное животное, которое может видеть ультрафиолетовый свет, это пчела.",
    "Морские звезды могут отрастить свои конечности.",
    "У кенгуру нет возможности двигаться назад.",
    "Слоны - единственные животные, которые не могут прыгать.",
    "Пингвины могут подпрыгивать до 2 метров в воздухе.",
    "Медведи панды родом из Китая, на самом деле, не являются настоящими пандами.",
    "Самка кенгуру может иметь до трех детенышей одновременно.",
    "Жирафы могут пройти без воды дольше, чем верблюды.",
    "Дельфины спят с одним открытым глазом.",
    "В небе над Бразилией обитают муравьи, которые выращивают грибы.",
    "Осьминоги имеют три сердца.",
    "Гусеницы имеют 12 мускульных ног.",
    "Лошади могут спать, стоя.",
    "У домашних кошек есть более 100 различных звуковых сигналов.",
    "Петухи кукарекают утром, чтобы объявить своё присутствие.",
    "Медведи могут обонять еду на расстоянии до 32 км.",
    "Муравьи стали земляными инженерами. Вот уже 55 миллионов лет их конструкции неизменны.",
    "Для воспитания птенцов жирафы никогда не ложатся.",
    "Жирафы не могут оборачивать голову из-за длинной шеи.",
    "Наука знает больше 6000 языков.",
]
let n = 0
let d = 0
let generate = () => {
    let fact = document.getElementById('fun-fact')
    if (n == 0 && n < 5) {
        fact.textContent = 'Забавный факт загружается..'
        setTimeout(() => {
            fact.textContent = facts[Number((Math.random() * facts.length).toFixed(0))] ?? 'Ошибка при генерации, тебе повезло!'
            d++
        }, Math.random() * 1000)
        n++
    } else if (n > 5 && n <= 8) {
        fact.textContent = 'Перестаньте кликать на меня!'
    } else if (n > 8 && n <= 10) {
        fact.textContent = 'Так и быть, я сдаюсь!'
    } else if (n > 10) {
        fact.style.display = 'none'
    }
    if (d) n++
}